; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-34)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 )
(:init
(arm-empty)
(on b1 b12)
(on b2 b15)
(on b3 b11)
(on-table b4)
(on b5 b26)
(on b6 b2)
(on b7 b5)
(on b8 b31)
(on b9 b34)
(on-table b10)
(on-table b11)
(on b12 b14)
(on b13 b27)
(on-table b14)
(on b15 b29)
(on-table b16)
(on-table b17)
(on b18 b30)
(on b19 b23)
(on b20 b10)
(on b21 b7)
(on b22 b3)
(on b23 b25)
(on-table b24)
(on b25 b1)
(on b26 b6)
(on b27 b22)
(on b28 b17)
(on b29 b33)
(on b30 b13)
(on b31 b21)
(on-table b32)
(on b33 b16)
(on b34 b20)
(clear b4)
(clear b8)
(clear b9)
(clear b18)
(clear b19)
(clear b24)
(clear b28)
(clear b32)
)
(:goal
(and
(on b1 b3)
(on b2 b27)
(on b4 b21)
(on b5 b13)
(on b6 b25)
(on b7 b17)
(on b8 b12)
(on b11 b29)
(on b12 b18)
(on b13 b20)
(on b15 b26)
(on b16 b6)
(on b17 b34)
(on b18 b4)
(on b19 b28)
(on b20 b30)
(on b21 b19)
(on b22 b15)
(on b23 b8)
(on b24 b31)
(on b25 b23)
(on b26 b24)
(on b27 b5)
(on b31 b14)
(on b32 b9)
(on b33 b22)
(on b34 b2))
)
)

; plan
1. (unstack b9 b34)
   deleted: (on b9 b34) (clear b9) (arm-empty)
   added: (holding b9) (clear b34)
   goals met: 0 of 27
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 27
3. (unstack b34 b20)
   deleted: (on b34 b20) (clear b34) (arm-empty)
   added: (holding b34) (clear b20)
   goals met: 0 of 27
4. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 0 of 27
5. (unstack b20 b10)
   deleted: (on b20 b10) (clear b20) (arm-empty)
   added: (holding b20) (clear b10)
   goals met: 0 of 27
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 27
7. (unstack b18 b30)
   deleted: (on b18 b30) (clear b18) (arm-empty)
   added: (holding b18) (clear b30)
   goals met: 0 of 27
8. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 27
9. (unstack b30 b13)
   deleted: (on b30 b13) (clear b30) (arm-empty)
   added: (holding b30) (clear b13)
   goals met: 0 of 27
10. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 0 of 27
11. (unstack b13 b27)
   deleted: (on b13 b27) (clear b13) (arm-empty)
   added: (holding b13) (clear b27)
   goals met: 0 of 27
12. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 27
13. (unstack b27 b22)
   deleted: (on b27 b22) (clear b27) (arm-empty)
   added: (holding b27) (clear b22)
   goals met: 0 of 27
14. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 27
15. (unstack b22 b3)
   deleted: (on b22 b3) (clear b22) (arm-empty)
   added: (holding b22) (clear b3)
   goals met: 0 of 27
16. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 27
17. (unstack b3 b11)
   deleted: (on b3 b11) (clear b3) (arm-empty)
   added: (holding b3) (clear b11)
   goals met: 0 of 27
18. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 27
19. (unstack b19 b23)
   deleted: (on b19 b23) (clear b19) (arm-empty)
   added: (holding b19) (clear b23)
   goals met: 0 of 27
20. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 27
21. (unstack b23 b25)
   deleted: (on b23 b25) (clear b23) (arm-empty)
   added: (holding b23) (clear b25)
   goals met: 0 of 27
22. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 27
23. (unstack b25 b1)
   deleted: (on b25 b1) (clear b25) (arm-empty)
   added: (holding b25) (clear b1)
   goals met: 0 of 27
24. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 27
25. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 0 of 27
26. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 27
27. (unstack b12 b14)
   deleted: (on b12 b14) (clear b12) (arm-empty)
   added: (holding b12) (clear b14)
   goals met: 0 of 27
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 27
29. (unstack b8 b31)
   deleted: (on b8 b31) (clear b8) (arm-empty)
   added: (holding b8) (clear b31)
   goals met: 0 of 27
30. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 27
31. (unstack b31 b21)
   deleted: (on b31 b21) (clear b31) (arm-empty)
   added: (holding b31) (clear b21)
   goals met: 0 of 27
32. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 0 of 27
33. (unstack b21 b7)
   deleted: (on b21 b7) (clear b21) (arm-empty)
   added: (holding b21) (clear b7)
   goals met: 0 of 27
34. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 27
35. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 0 of 27
36. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 27
37. (unstack b5 b26)
   deleted: (on b5 b26) (clear b5) (arm-empty)
   added: (holding b5) (clear b26)
   goals met: 0 of 27
38. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 27
39. (unstack b26 b6)
   deleted: (on b26 b6) (clear b26) (arm-empty)
   added: (holding b26) (clear b6)
   goals met: 0 of 27
40. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 27
41. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 0 of 27
42. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 27
43. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 0 of 27
44. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 27
45. (unstack b15 b29)
   deleted: (on b15 b29) (clear b15) (arm-empty)
   added: (holding b15) (clear b29)
   goals met: 0 of 27
46. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 27
47. (unstack b29 b33)
   deleted: (on b29 b33) (clear b29) (arm-empty)
   added: (holding b29) (clear b33)
   goals met: 0 of 27
48. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 27
49. (unstack b33 b16)
   deleted: (on b33 b16) (clear b33) (arm-empty)
   added: (holding b33) (clear b16)
   goals met: 0 of 27
50. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 0 of 27
51. (unstack b28 b17)
   deleted: (on b28 b17) (clear b28) (arm-empty)
   added: (holding b28) (clear b17)
   goals met: 0 of 27
52. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 0 of 27
53. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 0 of 27
54. (stack b19 b28)
   deleted: (clear b28) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b28)
   goals met: 1 of 27
55. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 1 of 27
56. (stack b21 b19)
   deleted: (clear b19) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b19)
   goals met: 2 of 27
57. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 2 of 27
58. (stack b4 b21)
   deleted: (clear b21) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b21)
   goals met: 3 of 27
59. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 3 of 27
60. (stack b18 b4)
   deleted: (clear b4) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b4)
   goals met: 4 of 27
61. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 4 of 27
62. (stack b12 b18)
   deleted: (clear b18) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b18)
   goals met: 5 of 27
63. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 5 of 27
64. (stack b8 b12)
   deleted: (clear b12) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b12)
   goals met: 6 of 27
65. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 6 of 27
66. (stack b23 b8)
   deleted: (clear b8) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b8)
   goals met: 7 of 27
67. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 7 of 27
68. (stack b25 b23)
   deleted: (clear b23) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b23)
   goals met: 8 of 27
69. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 27
70. (stack b6 b25)
   deleted: (clear b25) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b25)
   goals met: 9 of 27
71. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 9 of 27
72. (stack b16 b6)
   deleted: (clear b6) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b6)
   goals met: 10 of 27
73. (pickup b32)
   deleted: (clear b32) (on-table b32) (arm-empty)
   added: (holding b32)
   goals met: 10 of 27
74. (stack b32 b9)
   deleted: (clear b9) (holding b32)
   added: (arm-empty) (clear b32) (on b32 b9)
   goals met: 11 of 27
75. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 11 of 27
76. (stack b20 b30)
   deleted: (clear b30) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b30)
   goals met: 12 of 27
77. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 12 of 27
78. (stack b13 b20)
   deleted: (clear b20) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b20)
   goals met: 13 of 27
79. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 13 of 27
80. (stack b5 b13)
   deleted: (clear b13) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b13)
   goals met: 14 of 27
81. (pickup b27)
   deleted: (clear b27) (on-table b27) (arm-empty)
   added: (holding b27)
   goals met: 14 of 27
82. (stack b27 b5)
   deleted: (clear b5) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b5)
   goals met: 15 of 27
83. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 15 of 27
84. (stack b2 b27)
   deleted: (clear b27) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b27)
   goals met: 16 of 27
85. (pickup b34)
   deleted: (clear b34) (on-table b34) (arm-empty)
   added: (holding b34)
   goals met: 16 of 27
86. (stack b34 b2)
   deleted: (clear b2) (holding b34)
   added: (arm-empty) (clear b34) (on b34 b2)
   goals met: 17 of 27
87. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 17 of 27
88. (stack b17 b34)
   deleted: (clear b34) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b34)
   goals met: 18 of 27
89. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 18 of 27
90. (stack b7 b17)
   deleted: (clear b17) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b17)
   goals met: 19 of 27
91. (pickup b31)
   deleted: (clear b31) (on-table b31) (arm-empty)
   added: (holding b31)
   goals met: 19 of 27
92. (stack b31 b14)
   deleted: (clear b14) (holding b31)
   added: (arm-empty) (clear b31) (on b31 b14)
   goals met: 20 of 27
93. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 20 of 27
94. (stack b24 b31)
   deleted: (clear b31) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b31)
   goals met: 21 of 27
95. (pickup b26)
   deleted: (clear b26) (on-table b26) (arm-empty)
   added: (holding b26)
   goals met: 21 of 27
96. (stack b26 b24)
   deleted: (clear b24) (holding b26)
   added: (arm-empty) (clear b26) (on b26 b24)
   goals met: 22 of 27
97. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 22 of 27
98. (stack b15 b26)
   deleted: (clear b26) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b26)
   goals met: 23 of 27
99. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 23 of 27
100. (stack b22 b15)
   deleted: (clear b15) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b15)
   goals met: 24 of 27
101. (pickup b33)
   deleted: (clear b33) (on-table b33) (arm-empty)
   added: (holding b33)
   goals met: 24 of 27
102. (stack b33 b22)
   deleted: (clear b22) (holding b33)
   added: (arm-empty) (clear b33) (on b33 b22)
   goals met: 25 of 27
103. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 25 of 27
104. (stack b11 b29)
   deleted: (clear b29) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b29)
   goals met: 26 of 27
105. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 26 of 27
106. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 27 of 27
